[
  {
    "link": "https://enforcementdirectorate.gov.in/sites/default/files/latestnews/Press%20Release-Search-BISWA-20.12.2024%205.pdf",
    "title": "ED, Bhubaneswar has conducted search operations at 04 locations in Odisha and Delhi under the provisions of PMLA, 2002 on 18.12.2024 in connection with an investigation being carried out against Bharat Integrated Social Welfare Agency (BISWA). During the searches, various incriminating document, digital devices and shares worth Rs. 10 Lakh were recovered and seized, an amount of more than 72 Lakh lying in 505 different bank accounts has been frozen.",
    "pubDate": "20/Dec/2024",
    "contentSnippet": ""
  },
  {
    "link": "https://enforcementdirectorate.gov.in/sites/default/files/latestnews/Press%20Release-Liquor_scam_searches_20.12.2024%204.pdf",
    "title": "ED, Raipur has conducted search operations at 6 premises situated at Raipur and Gariyaband districts of Chhattisgarh on 18.12.2024 under the provisions of PMLA, 2002 in the Liquor scam case of Chhattisgarh. During the search operations, various incriminating documents, cash and digital devices were seized.",
    "pubDate": "20/Dec/2024",
    "contentSnippet": ""
  },
  {
    "link": "https://enforcementdirectorate.gov.in/sites/default/files/latestnews/Press%20Release%20-Search%20on%20CSK%20Realtors-20.12.2024%203.pdf",
    "title": "ED, Hyderabad has conducted search operations on 19.12.2024 under the provisions of the PMLA, 2002 at two premises in Hyderabad related to M/s CSK Realtors Ltd., M/s Singh Mansions Pvt. Ltd., Suresh Kr. Agarwal and Rakshit Agarwal in the case of M/s SIVIPL fraud. During the searches, various incriminating documents, unaccounted cash amounting to Rs. 72.75 Lakh and jewellery & bullion valued at Rs. 5.42 Crore were recovered and seized.",
    "pubDate": "20/Dec/2024",
    "contentSnippet": ""
  },
  {
    "link": "https://enforcementdirectorate.gov.in/sites/default/files/latestnews/Press%20Release%20-convicted%20Charanjit%20Singh-20.12.2024%202.pdf",
    "title": "The Hon’ble Special Court (PMLA), Jalandhar has convicted Charanjit Singh, S/o Bishan Singh under section 4 of PMLA, 2002 for committing the offence of Money Laundering as defined under section 3 of PMLA, 2002. The Hon’ble Court has found Charanjit Singh guilty and sentenced him for 3 years of rigorous imprisonment and a fine of ten thousand rupees. Further, his properties which were earlier attached by the Directorate of Enforcement (ED) have been confiscated u/s 8(5) of the PMLA, 2002.",
    "pubDate": "20/Dec/2024",
    "contentSnippet": ""
  },
  {
    "link": "https://enforcementdirectorate.gov.in/sites/default/files/latestnews/%E0%A4%AA%E0%A5%8D%E0%A4%B0%E0%A5%87%E0%A4%B8%20%E0%A4%B5%E0%A4%BF%E0%A4%9C%E0%A5%8D%E0%A4%9E%E0%A4%AA%E0%A5%8D%E0%A4%A4%E0%A4%BF-%E0%A4%95%E0%A4%B2%E0%A5%8D%E0%A4%AA%E0%A4%A4%E0%A4%B0%E0%A5%81%20%E0%A4%A4%E0%A4%B2%E0%A4%BE%E0%A4%B6%E0%A5%80%20-19.12.2024%201.pdf",
    "title": "प्रवर्तन निदेशालय (ईडी), लखनऊ जोनल कार्यालय ने कल्पतरु ग्रुप ऑफ़ कंपनीज़ द्वारा चलाए गए पोंजी स्कीम/एमएलएम मामले के संबंध में मुख्य आरोपी स्वर्गीय जय किशन राणा की पत्नी मिथिलेश सिंह, उनके करीबी सहयोगियों, चार्टर्ड अकाउंटेंट, दलालों और एजेंटों जैसे सुमन प्रभा शर्मा, देवेंद्र गर्ग, हरेंद्र तरकर, रामवीर तरकर, प्रखर गर्ग, शिवम अग्रवाल और अन्य के आगरा, मथुरा और नोएडा, उत्तर प्रदेश में 16 परिसरों पर18/12/2024 को तलाशी ली है। तलाशी अभियान के दौरान 1.02 करोड़ रुपये की अघोषित नकदी, 88 अचल संपत्तियों के बिक्री विलेख/दस्तावेज, डिजिटल/इलेक्ट्रॉनिक साक्ष्य पाए गए और उन्हें जब्त कर लिया गया।",
    "pubDate": "19/Dec/2024",
    "contentSnippet": ""
  },
  {
    "link": "https://enforcementdirectorate.gov.in/sites/default/files/latestnews/%E0%A4%AA%E0%A5%8D%E0%A4%B0%E0%A5%87%E0%A4%B8%20%E0%A4%B5%E0%A4%BF%E0%A4%9C%E0%A5%8D%E0%A4%9E%E0%A4%AA%E0%A5%8D%E0%A4%A4%E0%A4%BF-%20%E0%A4%B8%E0%A4%B0%E0%A5%8D%E0%A4%9A%20%E0%A4%87%E0%A4%A8%20%E0%A4%B8%E0%A5%8D%E0%A4%AA%E0%A5%87%E0%A4%95%E0%A5%8D%E0%A4%9F%E0%A5%8D%E0%A4%B0%E0%A4%BE%20%E0%A4%87%E0%A4%82%E0%A4%A1%E0%A4%B8%E0%A5%8D%E0%A4%9F%E0%A5%8D%E0%A4%B0%E0%A5%80%E0%A4%9C%2018.12.2024%205.pdf",
    "title": "ईडी, मुंबई ने मेसर्स स्पेक्ट्रा इंडस्ट्रीज लिमिटेड (एसआईएल) और अन्य के खिलाफ बैंक धोखाधड़ी से जुड़े मनी लॉन्ड्रिंग मामले में पीएमएलए, 2002 के प्रावधानों के तहत 17.12.2024 को मुंबई और औरंगाबाद में 9 अलग-अलग स्थानों पर तलाशी अभियान चलाया। तलाशी अभियान में 8 करोड़ रुपये के बैंक बैलेंस, फिक्स्ड डिपॉजिट, इक्विटी शेयर और प्रतिभूतियों को फ्रीज कर दिया गया।",
    "pubDate": "18/Dec/2024",
    "contentSnippet": ""
  },
  {
    "link": "https://enforcementdirectorate.gov.in/sites/default/files/latestnews/%E0%A4%AA%E0%A5%8D%E0%A4%B0%E0%A5%87%E0%A4%B8%20%E0%A4%B5%E0%A4%BF%E0%A4%9C%E0%A5%8D%E0%A4%9E%E0%A4%AA%E0%A5%8D%E0%A4%A4%E0%A4%BF%20-%E0%A4%97%E0%A4%BF%E0%A4%B0%E0%A4%AB%E0%A4%BC%E0%A5%8D%E0%A4%A4%E0%A4%BE%E0%A4%B0%E0%A5%80-%E0%A4%AF%E0%A5%82%E0%A4%8F%E0%A4%A8%E0%A4%8F%E0%A4%B2%E0%A4%8F%E0%A4%AB_18.12.2024%204.pdf",
    "title": "प्रवर्तन निदेशालय (ईडी), नई दिल्ली ने यूनाइटेड नेशनल लिबरेशन फ्रंट (यूएनएलएफ) के दो कार्यकर्ताओं थोकचोम ज्ञानेशोर उर्फ ​​थोइबा उर्फ ​​सिदाबामापु और लाइमायम आनंद शर्मा उर्फ ​​इंगबा को 16.10.2024 को धन शोधन निवारण अधिनियम (पीएमएलए), 2002 के प्रावधानों के तहत गिरफ्तार किया था और 12.12.2024 को माननीय पटियाला हाउस कोर्ट, दिल्ली के समक्ष अभियोजन शिकायत (पीसी) दायर की थी। माननीय न्यायालय ने 18.12.2024 को अभियोजन शिकायत का संज्ञान लिया है। वर्तमान में दोनों आरोपी न्यायिक हिरासत में हैं।",
    "pubDate": "18/Dec/2024",
    "contentSnippet": ""
  },
  {
    "link": "https://enforcementdirectorate.gov.in/sites/default/files/latestnews/%E0%A4%AA%E0%A5%8D%E0%A4%B0%E0%A5%87%E0%A4%B8%20%E0%A4%B5%E0%A4%BF%E0%A4%9C%E0%A5%8D%E0%A4%9E%E0%A4%AA%E0%A5%8D%E0%A4%A4%E0%A4%BF-%20%E0%A4%95%E0%A5%89%E0%A4%A8%E0%A5%8D%E0%A4%95%E0%A4%BE%E0%A4%B8%E0%A5%8D%E0%A4%9F%20%E0%A4%97%E0%A5%8D%E0%A4%B0%E0%A5%81%E0%A4%AA%2018.12.2024%203.pdf",
    "title": "ईडी, कोलकाता ने बैंक धोखाधड़ी मामले के संबंध में पीएमएलए, 2002 के प्रावधानों के तहत कॉनकास्ट स्टील एंड पावर ग्रुप के 13 स्थानों पर तलाशी अभियान चलाया। तलाशी अभियान के दौरान, विभिन्न आपत्तिजनक दस्तावेज, डिजिटल साक्ष्य, 4.5 करोड़ रुपये मूल्य के सोने और आभूषण तथा लग्जरी वाहनों सहित 8 वाहन बरामद किए गए और उन्हें जब्त कर लिया गया।",
    "pubDate": "18/Dec/2024",
    "contentSnippet": ""
  },
  {
    "link": "https://enforcementdirectorate.gov.in/sites/default/files/latestnews/%E0%A4%AA%E0%A5%8D%E0%A4%B0%E0%A5%87%E0%A4%B8%20%E0%A4%B5%E0%A4%BF%E0%A4%9C%E0%A5%8D%E0%A4%9E%E0%A4%AA%E0%A5%8D%E0%A4%A4%E0%A4%BF-%E0%A4%AA%E0%A5%80%E0%A4%8F%E0%A4%93%20%E0%A4%8F%E0%A4%9A%E0%A4%9F%E0%A5%80%E0%A4%AA%E0%A5%80%E0%A4%8F%E0%A4%B2%2018.12.2024%202.pdf",
    "title": "ईडी, अहमदाबाद ने मेसर्स हेलिओस ट्यूबलॉयज प्राइवेट लिमिटेड और अन्य के मामले में पीएमएलए, 2002 के प्रावधानों के तहत 17/12/2024 को 19.37 करोड़ रुपये मूल्य की अचल संपत्तियों को अनंतिम रूप से कुर्क किया है, जिसमें राजुला में वाणिज्यिक भूमि और अहमदाबाद में एक आवासीय फ्लैट शामिल है।",
    "pubDate": "18/Dec/2024",
    "contentSnippet": ""
  },
  {
    "link": "https://enforcementdirectorate.gov.in/sites/default/files/latestnews/%E0%A4%AA%E0%A5%8D%E0%A4%B0%E0%A5%87%E0%A4%B8%20%E0%A4%B5%E0%A4%BF%E0%A4%9C%E0%A5%8D%E0%A4%9E%E0%A4%AA%E0%A5%8D%E0%A4%A4%E0%A4%BF-%E0%A4%B8%E0%A5%80%E0%A4%B8%E0%A5%80%E0%A4%8F%E0%A4%B2%20PC%20Cognizance%20-18.12.2024%201.pdf",
    "title": "ईडी, लखनऊ ने 29.10.2024 को माननीय विशेष न्यायालय (पीएमएलए), लखनऊ के समक्ष धन शोधन निवारण अधिनियम, 2002 के प्रावधानों के तहत मेसर्स कोऑपरेटिव कंपनी लिमिटेड और अन्य के खिलाफ अभियोजन शिकायत (पीसी) दायर की है। माननीय न्यायालय ने 16.12.2024 को अभियोजन शिकायत का संज्ञान लिया है।",
    "pubDate": "18/Dec/2024",
    "contentSnippet": ""
  },
  {
    "link": "https://enforcementdirectorate.gov.in/sites/default/files/latestnews/%E0%A4%AA%E0%A5%8D%E0%A4%B0%E0%A5%87%E0%A4%B8%20%E0%A4%B5%E0%A4%BF%E0%A4%9C%E0%A5%8D%E0%A4%9E%E0%A4%AA%E0%A5%8D%E0%A4%A4%E0%A4%BF-%E0%A4%B8%E0%A4%B0%E0%A5%8D%E0%A4%9A%20%E0%A4%AC%E0%A4%BF%E0%A4%B8%E0%A5%8D%E0%A4%B5%E0%A4%BE%2020.12.2024%204.pdf",
    "title": "ईडी, भुवनेश्वर ने भारत एकीकृत सामाजिक कल्याण एजेंसी (बिस्वा) के खिलाफ की जा रही जांच के सिलसिले में 18.12.2024 को पीएमएलए, 2002 के प्रावधानों के तहत ओडिशा और दिल्ली में 04 स्थानों पर तलाशी अभियान चलाया। तलाशी के दौरान, विभिन्न आपत्तिजनक दस्तावेज, डिजिटल डिवाइस और 10 लाख रुपये के शेयर बरामद किए गए और उन्हें जब्त कर लिया गया, 505 विभिन्न बैंक खातों में पड़ी 72 लाख से अधिक की राशि को फ्रीज कर दिया गया है।",
    "pubDate": "20/Dec/2024",
    "contentSnippet": ""
  },
  {
    "link": "https://enforcementdirectorate.gov.in/sites/default/files/latestnews/%E0%A4%AA%E0%A5%8D%E0%A4%B0%E0%A5%87%E0%A4%B8%20%E0%A4%B5%E0%A4%BF%E0%A4%9C%E0%A5%8D%E0%A4%9E%E0%A4%AA%E0%A5%8D%E0%A4%A4%E0%A4%BF-%20%E0%A4%B6%E0%A4%B0%E0%A4%BE%E0%A4%AC%20%E0%A4%98%E0%A5%8B%E0%A4%9F%E0%A4%BE%E0%A4%B2%E0%A5%87%20%E0%A4%AE%E0%A5%87%E0%A4%82%20%E0%A4%A4%E0%A4%B2%E0%A4%BE%E0%A4%B6%E0%A4%BF%E0%A4%AF%E0%A4%BE%E0%A4%82%2020.12.2024%203.pdf",
    "title": "ईडी, रायपुर ने छत्तीसगढ़ के शराब घोटाला केस में पीएमएलए, 2002 के प्रावधानों के तहत 18.12.2024 को छत्तीसगढ़ के रायपुर और गरियाबंद जिलों में स्थित 6 परिसरों में तलाशी अभियान चलाया। तलाशी अभियान के दौरान, विभिन्न आपत्तिजनक दस्तावेज, नकदी और डिजिटल डिवाइस जब्त किए गए।",
    "pubDate": "20/Dec/2024",
    "contentSnippet": ""
  },
  {
    "link": "https://enforcementdirectorate.gov.in/sites/default/files/latestnews/Press%20Release%20-Search%20on%20CSK%20Realtors-20.12.2024%202.pdf",
    "title": "ईडी, हैदराबाद ने 19.12.2024 को पीएमएलए, 2002 के प्रावधानों के तहत मेसर्स सीएसके रियल्टर्स लिमिटेड, मेसर्स सिंह मेंशन प्राइवेट लिमिटेड, सुरेश कुमार अग्रवाल और रक्षित अग्रवाल से संबंधित हैदराबाद में मेसर्स एसआईवीआईपीएल धोखाधड़ी के मामले में तलाशी अभियान चलाया है । तलाशी के दौरान, विभिन्न आपत्तिजनक दस्तावेज, 72.75 लाख रुपये की बेहिसाब नकदी और 5.42 करोड़ रुपये के आभूषण और बुलियन बरामद किए गए और जब्त किए गए।",
    "pubDate": "20/Dec/2024",
    "contentSnippet": ""
  },
  {
    "link": "https://enforcementdirectorate.gov.in/sites/default/files/latestnews/Press%20Release%20-convicted%20Charanjit%20Singh-20.12.2024%201.pdf",
    "title": "माननीय विशेष न्यायालय (पीएमएलए), जालंधर ने चरणजीत सिंह, पुत्र बिशन सिंह को पीएमएलए, 2002 की धारा 3 के तहत यथा परिभाषित धन शोधन का अपराध करने के लिए पीएमएलए, 2002 की धारा 4 के तहत दोषी ठहराया है। माननीय न्यायालय ने चरणजीत सिंह को दोषी पाया है और उसे 3 वर्ष के कठोर कारावास और दस हजार रुपए के जुर्माने की सजा सुनाई है। इसके अलावा, उनकी संपत्ति, जो पहले प्रवर्तन निदेशालय (ईडी) द्वारा कुर्क की गई थी, को पीएमएलए, 2002 की धारा 8 (5) के तहत जब्त कर लिया गया है।",
    "pubDate": "20/Dec/2024",
    "contentSnippet": ""
  }
]